---
kind: property
id: P:Autodesk.Revit.DB.CylindricalHelix.BasePoint
source: html/23159307-9167-7a91-5d8f-87e8bac93571.htm
---
# Autodesk.Revit.DB.CylindricalHelix.BasePoint Property

The base point of the axis of the cylindrical helix.

## Syntax (C#)
```csharp
public XYZ BasePoint { get; }
```